import azorizdestihie from "../img/books/azorizdestihie.jpg";
import simonov from "../img/books/simonov.jpg";
import shelohov from "../img/books/shelohov.jpg";
import terkin from "../img/books/terkin.jpg";
import nezhenskoelico from "../img/books/nezhenskoelico.jpg";
import povest from "../img/books/povest.jpg";
import vspiskah from "../img/books/vspiskah.jpg";
import bukov from "../img/books/bukov.jpg";

const books = [
  {
    title: "А зори здесь тихие",
    author: "Борис Львович Васильев",
    year: "август 1969 г.",
    description:
      "«А зори здесь тихие…» — книга-предостережение, заставляющая ответить на вопрос: «А на что готов я ради своей Родины?». В основе сюжета повести Бориса Васильева лежит реально совершённый подвиг времён Великой Отечественной войны: семь самоотверженных солдат не дали немецкой диверсионной группе взорвать Кировскую железную дорогу, по которой доставляли для Мурманска снаряжение и войска. После сражения в живых остался лишь один командир группы. Уже во время работы над произведением автор решил заменить образы бойцов на женские, чтобы сделать историю более драматичной. В итоге получилась книга о женщинах-героях, поражающая читателей правдивостью повествования. Прообразами пяти девушек-добровольцев, вступающих в неравную схватку с группой фашистских диверсантов, стали сверстницы по школе писателя-фронтовика, также в них угадываются черты радисток, медсестёр, разведчиц, которых Васильев встречал в годы войны.",
    img: azorizdestihie
  },
  {
    title: "Живые и мёртвые",
    author: "Константин Михайлович Симонов",
    year: "1959 г.",
    description:
      "Константин Симонов широкому кругу читателей больше известен, как поэт. Его стихотворение «Жди меня» знают и помнят наизусть не только ветераны. Однако проза фронтовика ничуть не уступает его поэзии. Одним из самых сильных романов писателя считается эпопея «Живые и мёртвые», состоящая из книг «Живые и мёртвые», «Солдатами не рождаются», «Последнее лето». Это не просто роман о войне: первая часть трилогии практически воспроизводит личный фронтовой дневник писателя, который как корреспондент побывал на всех фронтах, прошёл по землям Румынии, Болгарии, Югославии, Польши и Германии, был свидетелем последних боёв за Берлин. На страницах книги автор воссоздаёт борьбу советского народа против фашистских захватчиков с самых первых месяцев страшной войны до знаменитого «последнего лета». Симоновский уникальный взгляд, талант поэта и публициста — всё это сделало «Живых и мертвых» одним из лучших художественных произведений в своём жанре.",
    img: simonov
  },
  {
    title: "Судьба человека",
    author: "Михаил Александрович Шолохов",
    year: "1957 г.",
    description:
      "В основе рассказа «Судьба человека» лежит реальная история, произошедшая с автором. В 1946 году Михаил Шолохов случайно встретил бывшего вояку, который рассказал писателю о своей жизни. Судьба мужчины настолько поразила Шолохова, что он решил запечатлеть её на страницах книги. В повести автор знакомит читателя с Андреем Соколовым, который сумел сохранить силу духа, несмотря на тяжёлые испытания: ранение, плен, побег, гибель семьи и, наконец, смерть сына в самый счастливый день, 9 мая 1945 года. После войны герой находит в себе силы, чтобы начать новую жизнь и подарить надежду другому человеку — он усыновляет осиротевшего мальчика Ваню. В «Судьбе человека» личная история на фоне страшных событий показывает судьбу целого народа и твёрдость русского характера, который можно назвать символом победы советских войск над фашистами.",
    img: shelohov
  },
  {
    title: "Василий Тёркин",
    author: "Александр Трифонович Твардовский",
    year: "1942 г.",
    description:
      "Поэма Твардовского «Василий Теркин» получила всенародное признание ещё в 1942 году, когда её первые главы были напечатаны в газете Западного фронта «Красноармейская правда». Солдаты сразу признали главного героя произведения образцом для подражания. Василий Тёркин — обычный русский парень, который искренне любит Родину и свой народ, с юмором воспринимает любые жизненные тяготы и находит выход даже из самого трудного положения. Кто-то видел в нём товарища по окопу, кто-то давнего приятеля, а кто-то угадывал в его чертах себя. Образ народного героя настолько полюбился читателям, что даже после войны с ним не хотели расставаться. Именно поэтому было написано огромное количество подражаний и «продолжений» «Василия Тёркина», созданных уже другими авторами.",
    img: terkin
  },
  {
    title: "У войны — не женское лицо",
    author: "Светлана Алексиевич",
    year: "1985 г.",
    description:
      "«У войны — не женское лицо» — одна из самых знаменитых книг о Великой Отечественной, где война показана глазами женщины. Роман был написан в 1983 году, но долгое время не печатался, так как его автора обвиняли в пацифизме, натурализме, в развенчании героического образа советской женщины. Однако Светлана Алексиевич писала совсем о другом: она показывала, что девушки и война — понятия несовместимые, хотя бы потому, что женщина даёт жизнь, тогда как любая война — прежде всего убивает. В своём романе Алексиевич собрала рассказы фронтовичек, чтобы показать, какими они были, девчонки сорок первого годка, и как уходили на фронт. Автор провела читателей по страшному, жестокому, не женскому пути войны.",
    img: nezhenskoelico
  },
  {
    title: "Повесть о настоящем человеке",
    author: "Борис Николаевич Полевой",
    year: "1946 г.",
    description:
      "«Повесть о настоящем человеке» создал писатель, прошедший всю Великую Отечественную войну в качестве корреспондента газеты «Правда». В эти страшные годы он успел побывать в партизанских отрядах в тылу врага, участвовал в Сталинградской битве, в сражении на Курской дуге. Но мировую известность Полевому принесли не военные репортажи, а художественное произведение, написанное на основе документальных материалов. Прототипом героя его «Повести о настоящем человеке» стал советский лётчик Алексей Маресьев, который был сбит в 1942 году во время наступательной операции Красной армии. Боец потерял обе ноги, но нашёл в себе силы вернуться в ряды действующих лётчиков и уничтожил ещё немало фашистских самолётов. Произведение было написано в тяжёлые послевоенные годы и сразу полюбилось читателю, ведь оно доказывало, что в жизни всегда есть место подвигу.",
    img: povest
  },
  {
    title: "В списках не значился",
    author: "Борис Львович Васильев",
    year: "1974 г.",
    description:
      "До сих пор герой повести Бориса Васильева считается символом всех неизвестных солдат, которые боролись до конца и умирали, не рассчитывая на славу. В повести «В списках не значился» автор не щадит читателя, он описывает войну в страшных подробностях, которые невозможно читать без душевной боли. Герой произведения Николай Плужников оказывается в Брестской крепости вечером накануне войны и по собственной воле становится её защитником. Последним защитником: «Крепость не пала: она просто истекла кровью. Я — последняя её капля». Через 9 месяцев у бойца закончились патроны, и только тогда Плужников вышел наверх. Такое мужество русского лейтенанта не просто наводило ужас на фашистов, оно вызывало уважение у противника.",
    img: vspiskah
  },
  {
    title: "Дожить до рассвета",
    author: "Василь Владимирович Быков",
    year: "1976 г.",
    description:
      "Василя Быкова называют автором самых пронзительных книг о войне. В своих произведениях он поднимает вечные вопросы: как в бесчеловечных обстоятельствах сохранить человечность? Ради чего страдает человек, только ли для себя живёт? На эти и другие вопросы ищут ответы персонажи одной из его самых знаменитых повестей «Доживём до рассвета». Главный герой — советский лейтенант Игорь Ивановский, которому хоть и не удаётся выполнить задание, взорвать немецкую базу боеприпасов, но он до последней минуты делает всё возможное и невозможное для победы своего народа. После сильного эмоционального финала повести (тяжело раненный Ивановский подрывает себя гранатой, чтобы уничтожить при этом врага) невозможно остаться равнодушным и не думать о страшных судьбах героев войны.",
    img: bukov
  }
];

export default books;
