import brest from "../img/events/1941/brest.jpg";
import elna from "../img/events/1941/elna.jpg";
import moscow from "../img/events/1941/moscow.png";
import rostov from "../img/events/1941/rostov.jpg";
import stalingrad from "../img/events/1942/stalingrad.jpg";
import kavkaz from "../img/events/1942/kavkaz.jpg";
import rzhev from "../img/events/1943/rzhev.jpg";
import krym from "../img/events/1943/krym.jpg";
import koncert from "../img/events/1943/koncert.jpg";
import syvorov from "../img/events/1943/syvorov.jpg";
import kiev from "../img/events/1943/kiev.jpg";
import ukraina from "../img/events/1944/ukraina.jpg";
import bagration from "../img/events/1944/bagration.jpg";
import bagration2 from "../img/events/1944/bagration2.jpg";
import bagration3 from "../img/events/1944/bagration3.jpg";
import bagration4 from "../img/events/1944/bagration4.jpg";
import berlin from "../img/events/1945/berlin.jpg";
import silezia from "../img/events/1945/silezia.jpg";
import vena from "../img/events/1945/vena.jpg";

const events = [
  {
    year: "1941",
    children: [
      {
        title: "Приграничные сражения 1941 года",
        subtitle: "Оборона Брестской крепости",
        date: "С 22 июня 1941 г. по 29 июня 1941 г.",
        description:
          "Приграничные сражения — это первые боевые действия Великой Отечественной войны, проходившие на территории Прибалтики, Украины и Белоруссии. Советский союз был не готов к войне, нападающая сторона имела огромное преимущество, вследствие чего немецкие войска разгромили Советские части или заставили их отступить.",
        img: brest
      },

      {
        title: "Первое освобождение Ельни",
        subtitle: "Прорыв немецкой обороны",
        date: "С 19 августа 1941 г. по 30 августа 1941 г.",
        description:
          "В июле 1941 года после взятия Ельни в ходе наступления на Москву немецкие войска встретили стойкое сопротивление советской армии. Не сумев его преодолеть и продвинуться ближе к Москве, противник был вынужден перейти к обороне.",
        img: elna
      },
      {
        title: "Оборона Москвы",
        subtitle: "Первое крупное поражение немцев на Восточном фронте",
        date: "С 30 сентября 1941 г. по 20 апреля 1942 г.",
        description:
          "Самыми крупными стратегическими объектами на Восточном фронте Гитлер по праву считал Ленинград и Москву. На овладение этими двумя городами он бросил огромные силы. От успеха немецких войск на этих двух направлениях зависела внешняя политика фюрера. Союзники Германии, как, впрочем, и США вместе с Англией и Францией, следили за развитием событий.",
        img: moscow
      },
      {
        title: "Битва за Ростов",
        subtitle: "Одно из первых успешных наступлений Красной Армии",
        date: "С 5 ноября 1941 г. по 2 декабря 1941 г.",
        description:
          "21 ноября 1941 года Ростов-на-Дону был полностью захвачен немцами. Через семь дней, после перегруппировки наши войска начали свое контрнаступление. Советские войска наносили удары с нескольких направлений и под их натиском гитлеровцы были вынуждены отступать, чтобы не дать Красной Армии завершить окружение. 29 ноября Ростов-на-Дону был освобожден, а советские войска продолжали преследование отступающего противника.",
        img: rostov
      }
    ]
  },
  {
    year: "1942",
    children: [
      {
        title: "Освобождение Сталинграда",
        subtitle: "Убито более одного миллиона человек",
        date: "С 17 июля 1942 г. по 2 февраля 1943 г.",
        description:
          "Сталинград был одним из крупнейших промышленных и транспортных центров страны. Перед Войной в нем проживало почти 500 тысяч человек. Город связывал центральные районы СССР с Кавказом, Средней Азией и Уралом. Особое значение имели коммуникации, по которым проходила транспортировка бакинской нефти.",
        img: stalingrad
      },

      {
        title: "Битва за Кавказ",
        subtitle: "Бои за нефть и горы Приэльбрусья",
        date: "С 25 июля 1942 г. по 9 октября 1943 г.",
        description:
          "В июле 1942 года Немецкие войска возобновили наступление в двух направлениях в надежде захватить Сталинград и Кавказ, осуществить план «Блау».  Для СССР Кавказ был основным источником нефти, здесь находились многое стратегические запасы страны. Однако немцы не смогли полностью осуществить свои замыслы, они понесли большие потери и были остановлены войсками Красной армии на подступах к Закавказью.",
        img: kavkaz
      }
    ]
  },
  {
    year: "1943",
    children: [
      {
        title: "Ржевская наступательная операция",
        subtitle: "Битва под Ржевом — каждую минуту погибало 11 человек",
        date: "С 1 марта 1943 г. по 30 марта 1943 г.",
        description:
          "Ржев был захвачен немецкими войсками в конце октября 1941 года в ходе генерального наступления на Москву. В результате двух контрнаступлений к осени 1942 года наши войска отбросили немцев обратно под Ржев, но освободить город так и не удалось. Образовалась двухсоткилометровая линия фронта вокруг Ржевско-Вяземского плацдарма, названная немецким командованием «ржевский мешок».",
        img: rzhev
      },

      {
        title: "Освобождение станицы Крымской",
        subtitle: "Обезврежено более 5000 вражеских мин",
        date: "С 28 апреля 1943 г. по 5 мая 1943 г.",
        description:
          "Зимняя часть Северо-Кавказской наступательной операции была завершена освобождением Краснодара и захватом плацдарма под Новороссийском (Малой земли). Весеннее бездорожье, необходимость перегруппировки и пополнения резервов остановило наступление наших войск. Немецкие войска отошли за первую линию «Головы Гота» («Голубой Линии»). Затишье на этом участке продолжалось до середины весны.",
        img: krym
      },
      {
        title: "Операция «Суворов»",
        subtitle: "100 000 квадратных километров освобожденной земли",
        date: "С 7 августа 1943 г. по 2 октября 1943 г.",
        description:
          "К началу августа 1943 года общая обстановка на советско-германском фронте, в том числе и на западном стратегическом направлении, определялась победами, одерживаемыми Советской Армией под Курском. Наши войска прочно держали в своих руках стратегическую инициативу, успешно ведя борьбу с основными силами гитлеровской Германии и ее союзников. В этих условиях было очень важно активными действиями на других направлениях нанести поражение как можно большим силам противника, чтобы не позволить ему использовать эти силы для противодействия нашему контрнаступлению. К таким участкам фронта в первую очередь относилось западное направление, как непосредственно примыкавшее к району курского выступа. Там Ставка Верховного Главнокомандования и готовила крупную наступательную операцию, придавая ей большое значение. Эта операция получила кодовое название «Суворов».",
        img: syvorov
      },
      {
        title: "Операция «Концерт»",
        subtitle: "Подрыв 150 000 рельсов",
        date: "С 19 сентября 1943 г. по 30 октября 1943 г.",
        description:
          "Успешное проведение партизанскими подразделениями операции «Рельсовая война» дало основание для разработки последующих кампаний по схожему сценарию. В начале сентября 1943 года Центральный штаб партизанского движения начал разработку и подготовку к новому массированному удару по тыловым коммуникациям немецких войск на оккупированных территориях под кодовым названием «Концерт».",
        img: koncert
      },
      {
        title: "Освобождение Киева",
        subtitle: "778 дней оккупации",
        date: "С 3 ноября 1943 г. по 13 ноября 1943 г.",
        description:
          "Киевский Особый военный округ одним из первых принял на себя удар летом 1941 года. С началом боевых действий он был переименован в Юго-Западный фронт, которым командовал Михаил Петрович Кирпонос.",
        img: kiev
      }
    ]
  },
  {
    year: "1944",
    children: [
      {
        title: "Освобождение Правобережной Украины",
        subtitle: "Второй сталинский удар",
        date: "С 4 марта 1944 г. по 17 апреля 1944 г.",
        description:
          "Наступательные операции 1-го и 2-го Украинских фронтов начались с разницей в один день, целью был разгром гитлеровской  группы армий «Юг» и выход к границам Молдавии и Румынии. В результате операций была освобождена практически вся Правобережная Украина, треть территорий Молдавии и заняты северные районы Румынии. Были созданы условия для успешного проведения Одесской операции и для полного уничтожения южного фланга вражеских войск в Ясско-Кишиневской операции.",
        img: ukraina
      },

      {
        title: "Операция Багратион. Часть I. Освобождение Витебска",
        subtitle: "Пятый сталинский удар",
        date: "С 23 июня 1944 г. по 29 июня 1944 г.",
        description:
          '23 июня 1944 началась Белорусская наступательная операция, получившая название "Багратион". Наступление наших войск велось одновременно на трех направлениях: Витебском, Могилевском и Бобруйском. 4 дня подряд Москва салютовала доблестным войнам трех Белорусских фронтов поочередно освободивших Витебск, Оршу, Могилев и Бобруйск.',
        img: bagration
      },
      {
        title: "Операция Багратион. Часть II. Освобождение Минска",
        subtitle: "Столица советской Белоруссии освобождена!",
        date: "С 29 июня 1944 г. по 4 июля 1944 г.",
        description:
          "После успешного завершения Витебско-Оршанской, Могилевской и Бобруйской операций войска Белорусских и Прибалтийских фронтов продолжили наступление. Теперь их целями были Минск и Полоцк. Разгром минской и полоцкой группировок противника наносил огромный ущерб гитлеровским войскам на восточном фронте. Минск был освобожден на исходе дня 3 июля, а утром 4 июля наши войска полностью очистили от врага Полоцк",
        img: bagration2
      },
      {
        title: "Операция Багратион. Часть III. Освобождение Вильнюса",
        subtitle: "Красный флаг над столицей советской Литвы",
        date: "С 5 июля 1944 г. по 28 августа 1944 г.",
        description:
          "Вильнюсская наступательная операция проводилась войсками 3-го Белорусского фронта при взаимодействии с частями польской армии Крайовой и двумя бригадами литовских партизан. Вильнюс был последним опорным пунктом гитлеровских войск на подступах к Восточной Пруссии. Бои за город продолжались пять дней, 13 июля 1944 наши войска сломили последние очаги сопротивления.",
        img: bagration3
      },
      {
        title: "Операция Багратион. Часть IV. Освобождение Бреста",
        subtitle: "Возвращение в Брестскую крепость",
        date: "С 5 июля 1944 г. по 16 сентября 1944 г.",
        description:
          "Люблин-Брестская операция стала завершающим этапом операции «Багратион». Проводилась операция силами 1-го Белорусского фронта с целью разгрома брестской и люблинской группировок противника. После ее окончания была полностью освобождена Белоруссия, а наши войска вплотную подошли к границе с Восточной Пруссией и Польшей",
        img: bagration4
      }
    ]
  },
  {
    year: "1945",
    children: [
      {
        title: "Освобождение Силезии",
        subtitle: "Ликвидация угрозы немецкого контрнаступления",
        date: "С 8 февраля 1945 г. по 31 марта 1945 г.",
        description:
          "Операции в немецкой Силезии являлись логичным продолжением Висло-одерской операции, они проводились силами Первого Украинского фронта. По итогам боевых действий Красная Армия продвинулась вглубь Германии более чем на 150 километров, ликвидировала угрозу контрнаступления на левый фланг Первого Белорусского фронта, занято выгодное положение для дальнейшего наступления на Берлин, существенно подорван военно-экономический потенциал Германии и взято много важных с точки зрения промышленности, населенных пунктов.",
        img: silezia
      },

      {
        title: "Освобождение Вены",
        subtitle: "Начало восстановления австрийской государственности",
        date: "С 16 марта 1945 г. по 15 апреля 1945 г.",
        description:
          'Столицу Австрии освобождали войска Третьего Украинского фронта совместно с частью сил Второго Украинского фронта. Девять дней продолжались бои за Вену. 12 апреля Военный совет фронта решил провести одновременный штурм города, всеми силами, участвовавшими в боях за город. К середине следующего дня город был очищен от немецких войск. 9 июня 1945 года Указом Президиума ВС СССР была учреждена медаль "За взятие Вены" .',
        img: vena
      },
      {
        title: "Взятие Берлина",
        subtitle: "Знамя Победы над Рейхстагом",
        date: "С 16 апреля 1945 г. по 8 мая 1945 г.",
        description:
          "Операция по взятию Берлина продолжалась 23 дня, за это время советские войска продвинулись вперед на расстояние от 100 до 220 километров. 25 апреля ровно в полдень кольцо окружения вокруг Берлина замкнулось, начался штурм города. В ночь с 2 на 3 мая город пал, гитлеровцы либо сдались в плен, либо были уничтожены или рассеяны. 8 мая в 22:43 по центральноевропейскому времени (9 мая 00:43 по МСК) был подписан акт о безоговорочной капитуляции Германии.",
        img: berlin
      }
    ]
  }
];

export default events;
