import azorizdestihie from "../img/video/azorizdestihie.jpg";
import vesna from "../img/video/vesna.jpg";
import stariki from "../img/video/stariki.jpg";
import oficeru from "../img/video/oficeru.jpg";
import zaRodiny from "../img/video/zaRodiny.jpg";
import sydba from "../img/video/sydba.jpg";
import zhuravli from "../img/video/zhuravli.jpg";
import navoine from "../img/video/navoine.jpg";

const films = [
  {
    title: "А зори здесь тихие",
    description:
      "Военная драма «А зори здесь тихие» представляет собой экранизацию одноименной повести Бориса Васильева. Великая Отечественная война, 1942 год, Карелия. В тылу советских войск расквартировано два отделения взвода зенитных войск. Под начало старшины Федора Васкова, бывшего разведчика времен Финской войны, попадают девушки-добровольцы. Одна из подопечных Васкова Рита Осянина, возвращаясь из самовольной отлучки, заметила в лесу двух вражеских диверсантов. Старшина решает остановить немецких разведчиков. Вместе с пятью девушками он отправляется на перехват диверсантов. Васков принимает решение устроить засаду в камнях, чтобы застать врасплох пробирающихся к железной дороге немцев. Но по роковой случайности вражеских шпионов оказывается далеко не двое, а целое подразделение. Шестнадцать отлично натренированных солдат вермахта против пяти девчонок-«зеленых» добровольцев.",
    img: azorizdestihie,
    href: "https://www.ivi.ru/watch/a_zori_zdes_tihie"
  },
  {
    title: "Семнадцать мгновений весны",
    description:
      "Действие картины разворачивается в Германии и Швейцарии в последние месяцы существования Третьего Рейха, с 12 февраля по 24 марта 1945 года. Главный герой – советский разведчик Максим Исаев, работающий в центральном аппарате СД под именем Макса Отто фон Штирлица. От московского руководства Штирлиц-Исаев получает задание: выяснить, кто из высших руководителей Рейха ведет сепаратные переговоры о заключении перемирия с Великобританией и США. Берлин подвергается жесткой бомбежке, в результате которой снаряд повреждает дом, в котором находятся радисты разведчика – супруги Эрвин и Кэтрин Кин. После взрыва Эрвин получает смертельное ранение, а его жена, которая находится в положении, чудом выживает. Ее в бессознательном состоянии отвозят в клинику Шарите, где, не в силах стерпеть боль, она случайно выкрикивает русское слово «мама» и выдает себя нацистам. Задача Штирлица осложняется: он остается без связи с Москвой, а его связистка оказывается в цепких лапах гестапо.",
    img: vesna,
    href: "https://www.ivi.ru/watch/17_mgnoveniy_vesny"
  },
  {
    title: "В бой идут одни «старики»",
    description:
      "«В бой идут одни «старики» – один из лучших советских фильмов о Великой Отечественной войне. С момента его выхода на экраны прошло вот уже 40 лет, но картину продолжают любить зрители разных поколений.\n" +
      "Фильм повествует о последних годах войны. «Поющая» эскадрилья летчиков сражается с «асами» Геринга, освобождая территорию Украины от немецко-фашистских захватчиков. «Старикам» этой эскадрильи на самом деле не больше двадцати, но каждый из них – мастер летного дела, готовый отдать жизнь за спасение своей Родины. Иногда все складывается благополучно, иногда трагично, но «старики» не останавливаются ни перед чем, поднимая боевой дух задорной песней и снова вступая в бой с врагами. Боевые вылеты и сражения с немцами перемежаются мирными буднями, в которых летчики просто живут, дружат, влюбляются, смеются и радуются жизни, не подозревая, что кого-то из них на следующий день может не стать…",
    img: stariki,
    href: "https://www.ivi.ru/watch/218167"
  },
  {
    title: "Офицеры",
    description:
      "Познакомившись во время войны, молодые офицеры Алексей Трофимова и Иван Варавва стали настоящими друзьями, проверенными огнем сражений. Долгие годы судьба не уставала сводить их жизненные пути. Драма, изначально задуманная как двухсерийная история о трудной судьбе офицерских жен, трансформировалась в песнь офицерству и преемственности военного призвания. Фильм стал лидером советского кинопроката и помирил на съемочной площадке исполнителей главных ролей: Георгия Юматова и Василия Ланового. Высокопоставленным «родителем» картины считается А.А.Гречко, министр обороны СССР, фраза которого «Есть такая профессия - Родину защищать» стала визитной карточкой фильма. Вновь друзья встречаются в Китайской народной республике, которой СССР оказывает помощь в войне с Японией. На Великую Отечественную войну Алексей Трофимов отправляется вместе с возмужавшим сыном Егором, супруга которого Маша тоже рвется на передовую, оставляя маленького сына Ивана на попечение бабушки Любы, вставшей во главе передвижного госпиталя. ",
    img: oficeru,
    href: "https://www.ivi.ru/watch/131522"
  },
  {
    title: "Они сражались за Родину",
    description:
      "Летом 1942 года Советский Союз оказывается на грани поражения. Немецкие войска, развивая крупный успех под Харьковом, разворачивают масштабное наступление на южном фланге. Советские солдаты отступают, оставляя мирных жителей на произвол судьбы. Растерзанный жестокими сражениями, но сильный духом стрелковый полк Красной Армии продолжает цепляться за каждую пядь родной земли. Яростные бои сменяются короткими передышками, привалы – новыми атаками… Переломный момент противостояния уже близок, но доживут до него не все.",
    img: zaRodiny,
    href: "https://www.ivi.ru/watch/oni_srazhalis_za_rodinu"
  },
  {
    title: "Судьба человека",
    description:
      "С началом Великой Отечественной войны жизнь многих людей изменилась. Вот и шоферу Андрею Соколову приходится оставить семью и отправиться на фронт. В первые же месяцы войны он попадает в немецкий плен. Но даже в этих ужасных условиях Андрей не теряет не только своего человеческого облика, но и мужества. Благодаря своей храбрости ему удается миновать расстрела, а потом и сбежать из фашистского плена. Но жизнь среди своих, за линией фронта, все равно не балует Андрея подарками. Он узнает, что в Воронеже во время бомбежки погибли его жена и дочь. А вскоре, уже вернувшись на фронт, он узнает, что в боях погиб и его сын. Так Андрей теряет всю свою семью и остается совсем один. После окончания войны ехать в родной Воронеж нет никакого смысла, ведь там его уже никто не ждет. Поэтому Соколов остается работать в Урюпинске и надеется построить какую-то новую жизнь. Именно здесь он встречает маленького мальчика Ваню, который тоже потерял всю семью в военные годы.",
    img: sydba,
    href: "https://www.ivi.ru/watch/53394"
  },
  {
    title: "Летят журавли",
    description:
      "Это трогательная и печальная история любви двух людей, которых навсегда разлучила война. Борис и Вероника безумно любят друг друга и планируют в скором времени пожениться. Но в их жизни, как и в жизни миллионов людей нашей страны, врывается война. Ничего не сказав возлюбленной, Борис уходит добровольцем на фронт, несмотря на то, что у него есть отвод от военной службы. Вероника остается с родителями, которых вскоре тоже теряет, они погибают во время бомбежки. Оставшись совсем одна и без жилища, она переезжает в дом Бориса по приглашению его отца. Не дождавшись известий от возлюбленного, девушка выходит замуж за двоюродного брата Бориса. А в это время, где-то на территории оккупированной врагами Борис отправляется в свою последнюю разведку. ",
    img: zhuravli,
    href: "https://www.ivi.ru/watch/53159"
  },
  {
    title: "На войне как на войне",
    description:
      "Младший лейтенант Малешкин только что закончил училище и теперь отправляется в Правобережную Украину, где идут тяжелые бои. Ему сразу же поручают командование экипажем самоходки СУ-100. И тут нашего героя ждут трудности и испытания. Во-первых, все его новые подчиненные не только старше, но и намного опытнее в военном деле. Во-вторых, командование новичком не слишком довольно. Малешкин никак не может собраться и стать настоящим бойцом Советской армии, вечно с ним случаются нелепые происшествия: то машина сломается прямо перед выходом на марш, то боевая граната каким-то странным образом окажется прямо в кабине. Бедный Малешкин совсем не знает, как ему, наконец, добиться расположения начальства и подчиненных. Но прямо в первом бою снова по нелепой случайности машина нашего неудачника оказывается в самой гуще сражения.",
    img: navoine,
    href: "https://www.ivi.ru/watch/26574"
  },
];

export default films;
